Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: WebSockets are not just for the server-side, you can use L<Mojo::UserAgent/"websocket_p"> to open new connections, which are always non-blocking.
ja: WebSockets are not just for the server-side, you can use [[Mojo::UserAgent/"websocket_p"]] to open new connections, which are always non-blocking.

source: What you can do instead, is to use a L<Mojolicious::Plugin::Config> or L<Mojolicious::Plugin::JSONConfig> configuration file.
ja: What you can do instead, is to use a [[Mojolicious::Plugin::Config]] or [[Mojolicious::Plugin::JSONConfig]] configuration file.

source: When all code references generated by this method have been executed and the event counter has reached zero, L</"steps"> will continue.
ja: When all code references generated by this method have been executed and the event counter has reached zero, [[/"steps"]] will continue.

source: When downloading large files with L<Mojo::UserAgent> you don't have to worry about memory usage at all, because it will automatically stream everything above 250KiB into a temporary file, which can then be moved into a permanent file with L<Mojo::Message/"save_to">.
ja: When downloading large files with [[Mojo::UserAgent]] you don't have to worry about memory usage at all, because it will automatically stream everything above 250KiB into a temporary file, which can then be moved into a permanent file with [[Mojo::Message/"save_to"]].

source: When either happens, the associated handlers queued up by a promise's L</"then"> method are called.
ja: When either happens, the associated handlers queued up by a promise's [[/"then"]] method are called.

source: When the L<Test::Mojo> object (C<$t>) goes out of scope, the application is stopped.
ja: When the [[Test::Mojo]] object (C<$t>) goes out of scope, the application is stopped.

source: When we make new test assertions using roles, we want to use method signatures that match other C<*_is> methods in L<Test::Mojo>, so here we accept the test object, the value to compare, and an optional description.
ja: When we make new test assertions using roles, we want to use method signatures that match other C<*_is> methods in [[Test::Mojo]], so here we accept the test object, the value to compare, and an optional description.

source: When we run these tests, L<Test::Mojo> will pass this configuration data to the application, which will cause it to create a special C</weather> route that we can access in our tests.
ja: When we run these tests, [[Test::Mojo]] will pass this configuration data to the application, which will cause it to create a special C</weather> route that we can access in our tests.

source: When we say L<Mojolicious> is a web framework we actually mean it, with L<Mojo::UserAgent> there's a full featured HTTP and WebSocket user agent built right in.
ja: When we say [[Mojolicious]] is a web framework we actually mean it, with [[Mojo::UserAgent]] there's a full featured HTTP and WebSocket user agent built right in.

source: Which in turn allows other event loops like L<AnyEvent> to just work.
ja: Which in turn allows other event loops like [[AnyEvent]] to just work.

source: While L<Mojolicious::Guides::Growing> will give you a detailed introduction to growing a L<Mojolicious::Lite> prototype into a well-structured L<Mojolicious> application, here we have collected a few snippets that illustrate very well just how similar both of them are.
ja: While [[Mojolicious::Guides::Growing]] will give you a detailed introduction to growing a [[Mojolicious::Lite]] prototype into a well-structured [[Mojolicious]] application, here we have collected a few snippets that illustrate very well just how similar both of them are.

source: While L<Mojolicious> has been designed from the ground up for non-blocking I/O and event loops, it is not possible to magically make Perl code non-blocking.
ja: While [[Mojolicious]] has been designed from the ground up for non-blocking I/O and event loops, it is not possible to magically make Perl code non-blocking.

source: While L<Test::Mojo> can be used to test any web application, it has shortcuts designed to make testing L<Mojolicious> web applications easy and pain-free.
ja: While [[Test::Mojo]] can be used to test any web application, it has shortcuts designed to make testing [[Mojolicious]] web applications easy and pain-free.

source: While all node types are represented as L<Mojo::DOM> objects, some methods like L</"attr"> and L</"namespace"> only apply to elements.
ja: While all node types are represented as [[Mojo::DOM]] objects, some methods like [[/"attr"]] and [[/"namespace"]] only apply to elements.

source: While many parts of L<Mojolicious> have been forked in the past, very few forks have been able to keep up with L<Mojolicious> development, and most are missing critical bug fixes.
ja: While many parts of [[Mojolicious]] have been forked in the past, very few forks have been able to keep up with [[Mojolicious]] development, and most are missing critical bug fixes.

source: While methods like L<Mojo::Message::Response/"is_success"> and L<Mojo::Message::Response/"is_error"> serve as building blocks for more sophisticated REST clients.
ja: While methods like [[Mojo::Message::Response/"is_success"]] and [[Mojo::Message::Response/"is_error"]] serve as building blocks for more sophisticated REST clients.

source: While post-processing tasks are generally very easy with the hook L<Mojolicious/"after_dispatch">, for content generated by the renderer it is a lot more efficient to use L<Mojolicious/"after_render">.
ja: While post-processing tasks are generally very easy with the hook [[Mojolicious/"after_dispatch"]], for content generated by the renderer it is a lot more efficient to use [[Mojolicious/"after_render"]].

source: While the L<Mojolicious::Guides> are carefully curated by the core team, everybody with a (free) GitHub account can make changes and add new information to the L<Mojolicious wiki|http://github.com/mojolicious/mojo/wiki>.
ja: While the [[Mojolicious::Guides]] are carefully curated by the core team, everybody with a (free) GitHub account can make changes and add new information to the [[Mojolicious wiki|http://github.com/mojolicious/mojo/wiki]].

source: While the L<Mojolicious> distribution covers a wide range of features, we are rather conservative when it comes to adding new ones.
ja: While the [[Mojolicious]] distribution covers a wide range of features, we are rather conservative when it comes to adding new ones.

source: While the message flow on WebSocket connections can be rather dynamic, it more often than not is quite predictable, which allows this rather pleasant L<Test::Mojo> WebSocket API to be used:
ja: While the message flow on WebSocket connections can be rather dynamic, it more often than not is quite predictable, which allows this rather pleasant [[Test::Mojo]] WebSocket API to be used:

source: While there are no rules in L<Mojolicious::Guides::Contributing> that forbid dependencies, we do currently discourage adding non-optional ones in favor of a faster and more painless installation process.
ja: While there are no rules in [[Mojolicious::Guides::Contributing]] that forbid dependencies, we do currently discourage adding non-optional ones in favor of a faster and more painless installation process.

source: Wildcard placeholders allow matching absolutely everything, including C</> and C<.>, similar to the regular expression C<(.+)>.
ja: ワイルドカードプレースホルダを使用すると、C</>とC<.>を含むすべてにマッチさせることができます。正規表現のC<(.+)>に似ています。

source: Windows is not officially supported by L<Mojolicious>, even though we try to keep the distribution installable.
ja: Windows is not officially supported by [[Mojolicious]], even though we try to keep the distribution installable.

source: With L<Mojo::UserAgent>, which is available through the helper L<Mojolicious::Plugin::DefaultHelpers/"ua">, there's a full featured HTTP and WebSocket user agent built right in.
ja: [[Mojo::UserAgent]]は、完全に機能を備えたHTTP 1.1とWebSocketの組み込みのユーザーエージェントです。[[Mojolicious::Plugin::DefaultHelpers]]のC<ua>を通して利用できます。

source: With L<Mojolicious::Command::Author::generate::lite_app> there is also a helper command to generate a small example application.
ja: [[Mojolicious::Command::Author::generate::lite_app]] には、小さなアプリケーションサンプルを生成するためのヘルパーコマンドがあります。

source: With the emergence of the real-time web and new technologies such as WebSockets, we are facing new challenges that go way beyond what commonly used modules like L<LWP> were designed for.
ja: With the emergence of the real-time web and new technologies such as WebSockets, we are facing new challenges that go way beyond what commonly used modules like [[LWP]] were designed for.

source: With the method L<Mojolicious::Routes::Route/"detour"> which is very similar to L<Mojolicious::Routes::Route/"to">, you can allow the route to partially match and use only the remaining path in the embedded application, the base path will be passed along in the C<path> stash value.
ja: With the method [[Mojolicious::Routes::Route/"detour"]] which is very similar to [[Mojolicious::Routes::Route/"to"]], you can allow the route to partially match and use only the remaining path in the embedded application, the base path will be passed along in the C<path> stash value.

source: With the method L<Mojolicious::Routes::Route/"websocket"> you can restrict access to WebSocket handshakes, which are normal C<GET> requests with some additional information.
ja: With the method [[Mojolicious::Routes::Route/"websocket"]] you can restrict access to WebSocket handshakes, which are normal C<GET> requests with some additional information.

source: Wrapping the helper result into a L<Mojo::ByteStream> object can prevent accidental double escaping.
ja: Wrapping the helper result into a [[Mojo::ByteStream]] object can prevent accidental double escaping.

source: Write data client-side, used to implement user agents such as L<Mojo::UserAgent>.
ja: Write data client-side, used to implement user agents such as [[Mojo::UserAgent]].

source: Write data server-side, used to implement web servers such as L<Mojo::Server::Daemon>.
ja: Write data server-side, used to implement web servers such as [[Mojo::Server::Daemon]].

source: XOR encode bytestream with L<Mojo::Util/"xor_encode">.
ja: XOR encode bytestream with [[Mojo::Util/"xor_encode"]].

source: You can activate C<permessage-deflate> compression with L<Mojo::Transaction::WebSocket/"with_compression">, this can result in much better performance, but also increases memory usage by up to 300KiB per connection.
ja: You can activate C<permessage-deflate> compression with [[Mojo::Transaction::WebSocket/"with_compression"]], this can result in much better performance, but also increases memory usage by up to 300KiB per connection.

source: You can also add your own conditions with the method L<Mojolicious::Routes/"add_condition">.
ja: You can also add your own conditions with the method [[Mojolicious::Routes/"add_condition"]].

source: You can also change the default namespaces for all routes in the application with the router attribute L<Mojolicious::Routes/"namespaces">, which usually defaults to a namespace based on the application class (C<MyApp::Controller>), as well as the bare application class (C<MyApp>).
ja: You can also change the default namespaces for all routes in the application with the router attribute [[Mojolicious::Routes/"namespaces"]], which usually defaults to a namespace based on the application class (C<MyApp::Controller>), as well as the bare application class (C<MyApp>).

source: You can also disable automatic rendering with the method L<Mojolicious::Controller/"render_later">, which can be very useful to delay rendering when a non-blocking operation has to be performed first.
ja: You can also disable automatic rendering with the method [[Mojolicious::Controller/"render_later"]], which can be very useful to delay rendering when a non-blocking operation has to be performed first.

source: You can also group related routes with L<Mojolicious::Lite/"group">, which allows nesting of routes generated with L<Mojolicious::Lite/"under">.
ja: [[Mojolicious::Lite]]のC<group>で関連するルーティングをグループ化(C<group>)することもできます。これによって、C<under>で生成したルートをネストできるようになります。

source: You can also introspect your application from the command line with L<Mojolicious::Command::eval>.
ja: [[Mojolicious::Command::eval]] を使うことでも、コマンドラインからアプリケーションを検証できます。

source: You can also render them manually with the helpers L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>exception"> and L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>not_found">.
ja: You can also render them manually with the helpers [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]exception"]] and [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]not_found"]].

source: You can also set the C<MOJO_FATAL_DEPRECATIONS> environment variable to make them die instead with L<Carp>.
ja: You can also set the C<MOJO_FATAL_DEPRECATIONS> environment variable to make them die instead with [[Carp]].

source: You can also use L<Mojolicious::Plugin::DefaultHelpers/"param"> to set them manually and let necessary attributes always be generated automatically.
ja: You can also use [[Mojolicious::Plugin::DefaultHelpers/"param"]] to set them manually and let necessary attributes always be generated automatically.

source: You can also use L<Mojo::IOLoop/"one_tick"> to embed the built-in web server L<Mojo::Server::Daemon> into alien environments like foreign event loops that for some reason can't just be integrated with a new reactor backend.
ja: You can also use [[Mojo::IOLoop/"one_tick"]] to embed the built-in web server [[Mojo::Server::Daemon]] into alien environments like foreign event loops that for some reason can't just be integrated with a new reactor backend.

source: You can also use L<Mojo::Transaction::WebSocket/"with_protocols"> to negotiate a subprotocol.
ja: You can also use [[Mojo::Transaction::WebSocket/"with_protocols"]] to negotiate a subprotocol.

source: You can also use subprocesses, created with L<Mojo::IOLoop/"subprocess">, to perform computationally expensive operations without blocking the event loop.
ja: You can also use subprocesses, created with [[Mojo::IOLoop/"subprocess"]], to perform computationally expensive operations without blocking the event loop.

source: You can also use the helper L<Mojolicious::Plugin::DefaultHelpers/"url_with"> to inherit query parameters from the current request.
ja: You can also use the helper [[Mojolicious::Plugin::DefaultHelpers/"url_with"]] to inherit query parameters from the current request.

source: You can assign a name with L<Mojolicious::Routes::Route/"name">, or let the router generate one automatically, which would be equal to the route itself without non-word characters, custom names have a higher precedence though.
ja: You can assign a name with [[Mojolicious::Routes::Route/"name"]], or let the router generate one automatically, which would be equal to the route itself without non-word characters, custom names have a higher precedence though.

source: You can call L</"finish"> or write an empty chunk of data at any time to end the stream.
ja: You can call [[/"finish"]] or write an empty chunk of data at any time to end the stream.

source: You can change the passphrase with the attribute L<Mojolicious/"secrets">.
ja: You can change the passphrase with the attribute [[Mojolicious/"secrets"]].

source: You can check for connection errors with L<Mojo::Transaction/"result">, or access HTTP request and response information directly through L<Mojo::Transaction/"req"> and L<Mojo::Transaction/"res">.
ja: You can check for connection errors with [[Mojo::Transaction/"result"]], or access HTTP request and response information directly through [[Mojo::Transaction/"req"]] and [[Mojo::Transaction/"res"]].

source: You can continue with L<Mojolicious::Guides> now or take a look at the L<Mojolicious wiki|http://github.com/mojolicious/mojo/wiki>, which contains a lot more documentation and examples by many different authors.
ja: さあ、[[Mojolicious::Guides]] を続けるか、[[Mojolicious wiki|http://github.com/mojolicious/mojo/wiki]]を見てみましょう。多くの著者がたくさんのドキュメントやサンプルを書いています。

source: You can easily change the whole template syntax by loading L<Mojolicious::Plugin::EPRenderer> with a custom configuration.
ja: You can easily change the whole template syntax by loading [[Mojolicious::Plugin::EPRenderer]] with a custom configuration.

source: You can even use CSS selectors with L<Mojolicious::Command::get> to extract only the information you're actually interested in.
ja: [[Mojolicious::Command::get]] でCSSセレクタを使えば、実際に知りたい情報だけを取り出すこともできます。

source: You can just pick the parts that actually matter with the CSS selectors from L<Mojo::DOM> and JSON Pointers from L<Mojo::JSON::Pointer>.
ja: You can just pick the parts that actually matter with the CSS selectors from [[Mojo::DOM]] and JSON Pointers from [[Mojo::JSON::Pointer]].

source: You can send JSON documents from the command line with L<Mojolicious::Command::get>.
ja: コマンドラインから[[Mojolicious::Command::get]]を使ってJSONドキュメントを送信できます。

source: You can support the ongoing development of L<Mojolicious> through PayPal (C<donations@mojolicious.org>).
ja: You can support the ongoing development of [[Mojolicious]] through PayPal (C<donations@mojolicious.org>).

source: You can take a closer look at all the generated regular expressions with the command L<Mojolicious::Command::routes>.
ja: 生成されたすべての正規表現は、 [[Mojolicious::Command::routes]]で詳しく確認することができます。

source: You can test the more advanced examples right from the command line with L<Mojolicious::Command::get>.
ja: [[Mojolicious::Command::get]]を使って、 コマンドラインからより発展的なサンプルをテストできます。

source: You can use L<Mojolicious/"home"> to interact with the directory your application considers its home.
ja: [[Mojolicious]]のC<home> を使うと、アプリケーションがホームとしているディレクトリにアクセスできます。

source: You can use L<Mojolicious::Plugin::DefaultHelpers/"validation"> to validate C<GET> and C<POST> parameters submitted to your application.
ja: You can use [[Mojolicious::Plugin::DefaultHelpers/"validation"]] to validate C<GET> and C<POST> parameters submitted to your application.

source: You can use L<Mojolicious::Renderer/"template_path"> to search the C<templates> directories of the application, and L<Mojolicious::Renderer/"get_data_template"> to search the C<DATA> sections.
ja: You can use [[Mojolicious::Renderer/"template_path"]] to search the C<templates> directories of the application, and [[Mojolicious::Renderer/"get_data_template"]] to search the C<DATA> sections.

source: You can use the L<Mojo::Log> object from L<Mojolicious/"log"> to portably collect debug messages and automatically disable them later in a production setup by changing the L<Mojolicious> operating mode, which can also be retrieved from the attribute L<Mojolicious/"mode">.
ja: ポータブルにデバッグメッセージを収集するために、[[Mojo]]のC<log>メソッドで[[Mojo::Log]]オブジェクトを利用できます。[[Mojolicious]]の処理モードを変更することによって、後のプロダクション用の設定においてデバッグを自動的に無効化することができます。これは[[Mojolicious]]のC<mode>属性によって読み取り可能です。

source: You can use the attributes L<Mojolicious/"max_request_size"> and L<Mojo::UserAgent/"max_response_size"> to change these values.
ja: You can use the attributes [[Mojolicious/"max_request_size"]] and [[Mojo::UserAgent/"max_response_size"]] to change these values.

source: You can usually leave this alone, see L<Mojolicious::Controller/"session"> for more information about working with session data.
ja: You can usually leave this alone, see [[Mojolicious::Controller/"session"]] for more information about working with session data.

source: You can wrap your blocking code in L<subprocesses|Mojo::IOLoop/"subprocess"> though to prevent it from interfering with your non-blocking code.
ja: You can wrap your blocking code in [[subprocesses|Mojo::IOLoop/"subprocess"]] though to prevent it from interfering with your non-blocking code.

source: You could, for example, just embed the built-in web server into an L<AnyEvent> application.
ja: You could, for example, just embed the built-in web server into an [[AnyEvent]] application.

source: You create L<Mojo::Promise> objects manually or use methods like L<Mojo::UserAgent/"get_p"> that create them for you.
ja: You create [[Mojo::Promise]] objects manually or use methods like [[Mojo::UserAgent/"get_p"]] that create them for you.

source: You don't have to render all content at once, the method L<Mojolicious::Controller/"write"> can also be used to stream a series of smaller chunks.
ja: You don't have to render all content at once, the method [[Mojolicious::Controller/"write"]] can also be used to stream a series of smaller chunks.

source: You have to use specialized non-blocking code available through modules like L<Mojo::IOLoop> and L<Mojo::UserAgent>, or third-party event loops.
ja: You have to use specialized non-blocking code available through modules like [[Mojo::IOLoop]] and [[Mojo::UserAgent]], or third-party event loops.

source: You just select the right layout template with the helper L<Mojolicious::Plugin::DefaultHelpers/"layout"> and place the result of the current template with the helper L<Mojolicious::Plugin::DefaultHelpers/"content">.
ja: You just select the right layout template with the helper [[Mojolicious::Plugin::DefaultHelpers/"layout"]] and place the result of the current template with the helper [[Mojolicious::Plugin::DefaultHelpers/"content"]].

source: You likely know the feeling, you've got a really cool idea and want to try it as quickly as possible, that's exactly why L<Mojolicious::Lite> applications don't need more than a single file.
ja: You likely know the feeling, you've got a really cool idea and want to try it as quickly as possible, that's exactly why [[Mojolicious::Lite]] applications don't need more than a single file.

source: You might also want to enable proxy support if you're using L<Hypnotoad|Mojo::Server::Hypnotoad> behind a reverse proxy.
ja: You might also want to enable proxy support if you're using [[Hypnotoad|Mojo::Server::Hypnotoad]] behind a reverse proxy.

source: You might have seen L<Mojo::Promise/"wait"> already in some examples above.
ja: You might have seen [[Mojo::Promise/"wait"]] already in some examples above.

source: Your application will automatically reload itself if you start it with the L<morbo> development web server, so you don't have to restart the server after every change.
ja: 開発用サーバーのC<morbo>でアプリケーションを起動すれば、 アプリケーションは自動的にリロードされます。ソースコードを変更した後に毎回サーバを再起動させる必要はありません。

source: get '/headers' => sub {
ja: # ブロッキング

source: get '/hello' => sub {
ja: # "hello.html.ep"というテンプレートを描画

source: get '/hello';
ja: # "hello.html.ep"というテンプレートを描画

source: get '/with_block' => 'block';
ja: use Mojolicious::Lite;

source: my $mojo = $c->ua->get_p('https://mojolicious.org');
ja: my $c = shift;

source: my $size = length $c->req->body;
ja: my $size = length $self->req->body;

source: return 1 if $name eq 'Bender';
ja: my $name = $self->param('name') || '';

source: under sub {
ja: # すべてのルートで共有されるグローバルなロジック

source: websocket '/echo' => sub {
ja: use Mojolicious::Lite;
